In [14]:
#Import libraries
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

#### SERIES

In [2]:
#Series is similar to a numpy array but can be indexed using numeric indexing

In [6]:
#Create a series from lists, array and dictionary
label=['a','b','c']
my_list=[10,20,30]#lists
arr=np.array([10,20,30])#array
d={'a':10,'b':20,'c':30}#dictionary

In [8]:
#Create a series from a list
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [9]:
#Create a series from lists with labels as index
pd.Series(data=my_list,index=label)

a    10
b    20
c    30
dtype: int64

In [10]:
#Create a series from a numpy array
pd.Series(arr,label)

a    10
b    20
c    30
dtype: int32

In [11]:
#create a series from a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

#### Series indexing

In [12]:
#indexing
ser1=pd.Series([1,2,3,4],index=['USA','GER','USSR','KEN'])
ser1

USA     1
GER     2
USSR    3
KEN     4
dtype: int64

In [13]:
ser1['KEN']

4

#### DATAFRAMES
It is a collection of many series put together and share a coomon index

In [16]:
#create a series with 4 columns and 5 rows

df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [17]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

#### Selection and indexing

In [18]:
#selecting a single column
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [20]:
#Select more than one column
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [21]:
type(df['W'])

pandas.core.series.Series

In [29]:
df['new']=df['W']+df['Z']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [31]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [32]:
df.drop('new',axis=1,inplace=True)

In [33]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
#drop rows(along axis=0)
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

#### LOC AND ILOC

LOC uses the axis labels while ILOC uses the numeric index(from 0 by default)

In [35]:
#selecting rows using labels
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [36]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [ ]:
#selecting a subset of rows and columns
df.loc[['A','B'],['W','Y']]